In [ ]:
pip install pandas

zsh:1: command not found: pip

In [ ]:
import pandas as pd

In [ ]:
data = {
    'Name': ['Arjun', 'Ravi', 'Priya'],
    'Age': [20, 30, 21],
    'City': ['Bengaluru', 'Mumbai', 'Mysuru']
}

df = pd.DataFrame(data)
print(df)

    Name  Age       City
0  Arjun   20  Bengaluru
1   Ravi   30     Mumbai
2  Priya   21     Mysuru

In [16]:
df[['Name','City']]

    Name       City
0  Arjun  Bengaluru
1   Ravi     Mumbai
2  Priya     Mysuru

In [18]:
print(df[df['Age']>21])

   Name  Age    City
1  Ravi   30  Mumbai

In [20]:
df['Age']>20

0    False
1     True
2     True
Name: Age, dtype: bool

In [27]:
datapath='sample_data.csv'
df=pd.read_csv(datapath)
df.head()

   1  2013-07-25 00:00:00.0  11599           CLOSED
0  2  2013-07-25 00:00:00.0    256  PENDING_PAYMENT
1  3  2013-07-25 00:00:00.0  12111         COMPLETE
2  4  2013-07-25 00:00:00.0   8827           CLOSED
3  5  2013-07-25 00:00:00.0  11318         COMPLETE
4  6  2013-07-25 00:00:00.0   7130         COMPLETE

In [28]:
df.tail()

           1  2013-07-25 00:00:00.0  11599           CLOSED
68877  68879  2014-07-09 00:00:00.0    778         COMPLETE
68878  68880  2014-07-13 00:00:00.0   1117         COMPLETE
68879  68881  2014-07-19 00:00:00.0   2518  PENDING_PAYMENT
68880  68882  2014-07-22 00:00:00.0  10000          ON_HOLD
68881  68883  2014-07-23 00:00:00.0   5533         COMPLETE

In [35]:
orders_columns=['order_id','order_date','order_customer_id','order_status']
df=pd.read_csv(datapath,names=orders_columns)
df

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [36]:
df.query?

Signature:
df.query(
    expr: 'str',
    *,
    parser: "Literal['pandas', 'python']" = 'pandas',
    engine: "Literal['python', 'numexpr'] | None" = None,
    local_dict: 'dict[str, Any] | None' = None,
    global_dict: 'dict[str, Any] | None' = None,
    resolvers: 'list[Mapping] | None' = None,
    level: 'int' = 0,
    inplace: 'bool' = False,
) -> 'DataFrame | None'
Docstring:
Query the columns of a DataFrame with a boolean expression.

.. warning::

    This method can run arbitrary code which can make you vulnerable to code
    injection if you pass user input to this function.

Parameters
----------
expr : str
    The query string to evaluate.

    See the documentation for :func:`eval` for details of
    supported operations and functions in the query string.

    See the documentation for :meth:`DataFrame.eval` for details on
    referring to column names and variables in the query string.
parser : {'pandas', 'python'}, default 'pandas'
    The parser to use to construct the syntax tree from the expression. The
    default of ``'pandas'`` parses code slightly different than standard
    Python. Alternatively, you can parse an expression using the
    ``'python'`` parser to retain strict Python semantics.  See the
    :ref:`enhancing performance <enhancingperf.eval>` documentation for
    more details.
engine : {'python', 'numexpr'}, default 'numexpr'

    The engine used to evaluate the expression. Supported engines are

    - None : tries to use ``numexpr``, falls back to ``python``
    - ``'numexpr'`` : This default engine evaluates pandas objects using
      numexpr for large speed ups in complex expressions with large frames.
    - ``'python'`` : Performs operations as if you had ``eval``'d in top
      level python. This engine is generally not that useful.

    More backends may be available in the future.
local_dict : dict or None, optional
    A dictionary of local variables, taken from locals() by default.
global_dict : dict or None, optional
    A dictionary of global variables, taken from globals() by default.
resolvers : list of dict-like or None, optional
    A list of objects implementing the ``__getitem__`` special method that
    you can use to inject an additional collection of namespaces to use for
    variable lookup. For example, this is used in the
    :meth:`~DataFrame.query` method to inject the
    ``DataFrame.index`` and ``DataFrame.columns``
    variables that refer to their respective :class:`~pandas.DataFrame`
    instance attributes.
level : int, optional
    The number of prior stack frames to traverse and add to the current
    scope. Most users will **not** need to change this parameter.
inplace : bool
    Whether to modify the DataFrame rather than creating a new one.

Returns
-------
DataFrame or None
    DataFrame resulting from the provided query expression or
    None if ``inplace=True``.

See Also
--------
eval : Evaluate a string describing operations on
    DataFrame columns.
DataFrame.eval : Evaluate a string describing operations on
    DataFrame columns.

Notes
-----
The result of the evaluation of this expression is first passed to
:attr:`DataFrame.loc` and if that fails because of a
multidimensional key (e.g., a DataFrame) then the result will be passed
to :meth:`DataFrame.__getitem__`.

This method uses the top-level :func:`eval` function to
evaluate the passed query.

The :meth:`~pandas.DataFrame.query` method uses a slightly
modified Python syntax by default. For example, the ``&`` and ``|``
(bitwise) operators have the precedence of their boolean cousins,
:keyword:`and` and :keyword:`or`. This *is* syntactically valid Python,
however the semantics are different.

You can change the semantics of the expression by passing the keyword
argument ``parser='python'``. This enforces the same semantics as
evaluation in Python space. Likewise, you can pass ``engine='python'``
to evaluate an expression using Python itself as a backend. This is not
recommended as it is inefficient compared to using ``numexpr`` as the
engine.

The :attr:`DataFrame.index` and
:attr:`DataFrame.columns` attributes of the
:class:`~pandas.DataFrame` instance are placed in the query namespace
by default, which allows you to treat both the index and columns of the
frame as a column in the frame.
The identifier ``index`` is used for the frame index; you can also
use the name of the index to identify it in a query. Please note that
Python keywords may not be used as identifiers.

For further details and examples see the ``query`` documentation in
:ref:`indexing <indexing.query>`.

*Backtick quoted variables*

Backtick quoted variables are parsed as literal Python code and
are converted internally to a Python valid identifier.
This can lead to the following problems.

During parsing a number of disallowed characters inside the backtick
quoted string are replaced by strings that are allowed as a Python identifier.
These characters include all operators in Python, the space character, the
question mark, the exclamation mark, the dollar sign, and the euro sign.

A backtick can be escaped by double backticks.

See also the `Python documentation about lexical analysis
<https://docs.python.org/3/reference/lexical_analysis.html>`__
in combination with the source code in :mod:`pandas.core.computation.parsing`.

Examples
--------
>>> df = pd.DataFrame(
...     {"A": range(1, 6), "B": range(10, 0, -2), "C&C": range(10, 5, -1)}
... )
>>> df
   A   B  C&C
0  1  10   10
1  2   8    9
2  3   6    8
3  4   4    7
4  5   2    6
>>> df.query("A > B")
   A  B  C&C
4  5  2    6

The previous expression is equivalent to

>>> df[df.A > df.B]
   A  B  C&C
4  5  2    6

For columns with spaces in their name, you can use backtick quoting.

>>> df.query("B == `C&C`")
   A   B  C&C
0  1  10   10

The previous expression is equivalent to

>>> df[df.B == df["C&C"]]
   A   B  C&C
0  1  10   10

Using local variable:

>>> local_var = 2
>>> df.query("A <= @local_var")
A   B  C&C
0  1  10   10
1  2   8    9
File:      /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/pandas/core/frame.py
Type:      method

In [44]:
df['order_status'].unique()
df.query('order_status=="COMPLETE"')
df.query("order_status==('COMPLETE','CLOSED')")

       order_id             order_date  order_customer_id order_status
0             1  2013-07-25 00:00:00.0              11599       CLOSED
2             3  2013-07-25 00:00:00.0              12111     COMPLETE
3             4  2013-07-25 00:00:00.0               8827       CLOSED
4             5  2013-07-25 00:00:00.0              11318     COMPLETE
5             6  2013-07-25 00:00:00.0               7130     COMPLETE
...         ...                    ...                ...          ...
68875     68876  2014-07-06 00:00:00.0               4124     COMPLETE
68877     68878  2014-07-08 00:00:00.0               6753     COMPLETE
68878     68879  2014-07-09 00:00:00.0                778     COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117     COMPLETE
68882     68883  2014-07-23 00:00:00.0               5533     COMPLETE

[30455 rows x 4 columns]

COUNT OF EACH ORDER STATUS

In [51]:
df.groupby('order_status')['order_status'].agg(order_count='count')

                 order_count
order_status
CANCELED                1428
CLOSED                  7556
COMPLETE               22899
ON_HOLD                 3798
PAYMENT_REVIEW           729
PENDING                 7610
PENDING_PAYMENT        15030
PROCESSING              8275
SUSPECTED_FRAUD         1558

In [60]:
x='1,2013-09-13 00:00:00.0,1,COMPLETE'
x=x.split(',')
x=x[1][:7]
x

'2013-09'

In [67]:
df['order_month']=df.apply(lambda x:x.order_date[:7],axis=1)
df['order_month']

0        2013-07
1        2013-07
2        2013-07
3        2013-07
4        2013-07
          ...
68878    2014-07
68879    2014-07
68880    2014-07
68881    2014-07
68882    2014-07
Name: order_month, Length: 68883, dtype: str

In [68]:
df

,order_id,order_date,order_customer_id,order_status,order_month
0,1,2013-07-25 00:00:00.0,11599,CLOSED,2013-07
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2013-07
2,3,2013-07-25 00:00:00.0,12111,COMPLETE,2013-07
3,4,2013-07-25 00:00:00.0,8827,CLOSED,2013-07
4,5,2013-07-25 00:00:00.0,11318,COMPLETE,2013-07
...,...,...,...,...,...
68878,68879,2014-07-09 00:00:00.0,778,COMPLETE,2014-07
68879,68880,2014-07-13 00:00:00.0,1117,COMPLETE,2014-07
68880,68881,2014-07-19 00:00:00.0,2518,PENDING_PAYMENT,2014-07
68881,68882,2014-07-22 00:00:00.0,10000,ON_HOLD,2014-07
68882,68883,2014-07-23 00:00:00.0,5533,COMPLETE,2014-07

In [70]:
df.groupby(['order_month','order_status'])['order_id'].agg(order_count='count')

                             order_count
order_month order_status
2013-07     CANCELED                  22
            CLOSED                   161
            COMPLETE                 515
            ON_HOLD                   81
            PAYMENT_REVIEW            19
...                                  ...
2014-07     PAYMENT_REVIEW            54
            PENDING                  517
            PENDING_PAYMENT          979
            PROCESSING               561
            SUSPECTED_FRAUD          101

[117 rows x 1 columns]